package main;
import "fmt";

func main(){
	arr :=[]string{"This","is","a","Go","interview","question","of","you"};
	slice :=arr[1:4];
	fmt.Println(slice);
	fmt.Println("capacity ",cap(slice));
	fmt.Println("Length ",len(slice));
	slice2 :=slice[1:2];
	fmt.Println("capacity ",cap(slice2));
	fmt.Println("Length ",len(slice2));


}

// স্টেপ-১: এখানে কোড সেগমেন্টে যা যা থাকবে তা হলো মেইন() মেথড, fmt.Println() মেথড, cap() মেথড, len মেথড

// স্টেপ-২: এখানে আগে স্ট্যাক-এ মেইন ফ্রেম তৈরি হবে, এরপর এখানে arr নামক স্লাইস থাকবে, এখানে যেহেতু সাইজ নেই তাই গোল্যাং ধরে নিবে যে এটা স্লাইস হবে।

// স্টেপ-৩: arr স্লাইসটার ভিতরে থাকবে পয়েন্টার অ্যাড্রেস, ক্যাপাসিটি এবং লেন্থ। এখন কথা হচ্ছে এই স্লাইস তো কোনো অ্যারে থেকে আসছে না তাহলে পয়েন্টার অ্যাড্রেস কী হবে। আমরা তো জানি Go কম্পাইলার এস্কেপ অ্যানালাইসিস করে দেখে রানটাইমে কোন ভ্যারিয়েবল হিপে অ্যাড্রেস এলোকেট করে স্টোর হবে আর কোন ভ্যারিয়েবল রানটাইমে স্ট্যাক-এ এলোকেট হবে। এই ইনস্ট্রাকশন কোড সেগমেন্টে আগেই আছে।

// স্টেপ-৪: এখন এই পয়েন্টারের ভিতরে যেগুলো আছে সেগুলোর জন্য হিপে অ্যাড্রেস এলোকেট করে ভ্যালুগুলো স্টোর হচ্ছে। এখানে লেন্থ হবে ৮ আর ক্যাপাসিটি হবে ৮। "This","is","a","Go","interview","question","of","you" এই ভ্যালুগুলো এদের জন্য হিপে এলোকেট করা অ্যাড্রেসে স্টোর হবে। তাহলে arr স্লাইস ভ্যারিয়েবলের ভিতরে যে পয়েন্টার অ্যাড্রেস থাকবে তা হবে ওই হিপে রাখা অ্যারে, যাকে আন্ডারলাইনিং অ্যারে বলা হয়, যার প্রথম এলিমেন্টের অ্যাড্রেস, লেন্থ এবং ক্যাপাসিটি স্ট্যাক-এর ভিতরে থাকা arr ভ্যারিয়েবলের ভিতরে স্টোর হবে।

// স্টেপ-৫: এখানে slice :=arr[1:4]; এই লাইনে দেখা যাচ্ছে যে এখানে arr স্লাইস ভ্যারিয়েবল যে সেলে থাকবে সেই সেলে থাকবে পয়েন্টার অ্যাড্রেস, ক্যাপাসিটি এবং লেন্থ। পয়েন্টার অ্যাড্রেস হবে arr যে আন্ডারলাইনিং অ্যারে আছে সেটার ইনডেক্স ১ এর অ্যাড্রেস। ক্যাপাসিটি হবে ৮-১=৭ আর লেন্থ হবে ৪-১=৩।

// স্টেপ-৬: fmt.Println(slice); এবার এই কোডের জন্য fmt.Println ফ্রেম তৈরি হবে। এখানে slice প্রিন্ট হবে মানে {"ইজ","আ","গো"} প্রিন্ট করবে। এটা কীভাবে করবে তার ডিটেইলস আমি problem-5 এর Step-4 এ ভালো করে বুঝিয়েছি। প্রিন্ট করা শেষে fmt.Println ফ্রেমটা পপ হবে।

// স্টেপ-৭: এরপর fmt.Println("capacity ",cap(slice)); এই লাইনের জন্য fmt.Println ফ্রেম তৈরি হবে। এরপর cap ফ্রেম তৈরি হবে তারপর slice যে সেলে আছে সেই সেলে তার ক্যাপাসিটি আছে সেটা নিয়ে এখানে প্রিন্ট করবে। এরপর cap ফ্রেম পপ হবে, এরপর fmt.Println ফ্রেম পপ হবে।

// স্টেপ-৮: এরপর fmt.Println("Length ",len(slice)); এই লাইনের জন্য fmt.Println ফ্রেম তৈরি হবে। এরপর len ফ্রেম তৈরি হবে তারপর slice যে সেলে আছে সেই সেলে তার লেন্থ আছে সেটা নিয়ে এখানে প্রিন্ট করবে। এরপর len ফ্রেম পপ হবে, এরপর fmt.Println ফ্রেম পপ হবে।

// স্টেপ-৯: slice2 নামক নতুন স্লাইস তৈরি করবে। যার ভিতরে থাকবে পয়েন্টার অ্যাড্রেস, ক্যাপাসিটি এবং লেন্থ। পয়েন্টার অ্যাড্রেস হবে হিপের ভিতরে আন্ডারলাইনিং অ্যারের ইনডেক্স ২ এর অ্যাড্রেস। ক্যাপাসিটি হবে যেহেতু ইনডেক্স ২, তাই ক্যাপাসিটি হবে ৮-২=৬। লেন্থ হবে ২-১=১

// স্টেপ-১০: এরপর fmt.Println("capacity ",cap(slice2)); এই লাইনের জন্য fmt.Println ফ্রেম তৈরি হবে। এরপর cap ফ্রেম তৈরি হবে তারপর slice2 যে সেলে আছে সেই সেলে তার ক্যাপাসিটি আছে সেটা নিয়ে এখানে প্রিন্ট করবে। এরপর cap ফ্রেম পপ হবে, এরপর fmt.Println ফ্রেম পপ হবে।

// স্টেপ-১১: এরপর fmt.Println("Length ",len(slice2)); এই লাইনের জন্য fmt.Println ফ্রেম তৈরি হবে। এরপর len ফ্রেম তৈরি হবে তারপর slice2 যে সেলে আছে সেই সেলে তার লেন্থ আছে সেটা নিয়ে এখানে প্রিন্ট করবে। এরপর len ফ্রেম পপ হবে, এরপর fmt.Println ফ্রেম পপ হবে।

// [ এখানে আন্ডারলাইনিং অ্যারে সবসময় হিপে হবে এটা কিন্তু হয় না, এটা স্ট্যাকেও হতে পারে। এটা পুরোপুরি ডিপেন্ড করে Go কম্পাইলারের escape analysis এর উপর ]